let 과일 = ['사과', '수박', '복숭아', '딸기', '바나나'];
과일[0] ='한라봉' // 0번째 과일을 한라봉으로 바꿈.

//결과 
['한라봉', '수박', '복숭아', '딸기', '바나나']

과일[0][0] = '한'
과일[0][0] = '오'
안바뀜 배열을 바꾼게 아니라 배열 안에 텍스트는 못바꾼다. 

let 과일2 = new Array(5);

let 과일3 = new Array('사과', '수박', '복숭아', '딸기', '바나나');



let text = 'abcde'

text
'abcde' //호출 결과

text[0] = 'z' //0번째에 z 넣기
'z'

text
'abcde' //호출 결과 안바뀜. 스트링은 안바뀜.


'01001'.replace(/0/g,' ').replace(/1/g,'#');
' #  #'
//?
let sample = [1,2,3];
for (let i in sample) {
  sample[i] *= 2 // sample[i] = sample[i] * 2
}
sample

//다차원 배열

let 전교점수 = [
  // 1반
  [[10, 20, 30, 40, 50],
  [20, 30, 40, 50, 60]],
  // 2반
  [[10, 20, 30, 40, 50],
  [20, 30, 40, 50, 60]],
];

//각각의 반의 평균을 구하라

전교점수 [0][0]

let 총합 = 0;

for (let i = 0; i < 5; i++){
    총합+= 전교점수[0][0][i];
}
총합

전교점수 [0][1]

let 총합2 = 0;

for (let i = 0; i < 5; i++){
    총합2 += 전교점수[0][1][i];
}
총합2

let 통계 = 0;
통계 = (총합 + 총합2)/10

let 더해지는수 = 0;
let 통계 = 0;
for(let i = 0; i < 2; i++ ){
  for (let j = 0; j < 5; j++) {
      통계 += 전교점수[0][i][j];
      더해지는수 ++;
  }
}
console.log(통계/더해진는수);


let 과일 = ['사과', '수박', '복숭아', '딸기', '바나나'];
let 과일선물 = ['체리', '멜론'];

과일.push('한라봉') 배열 마지막에 넣기.
과일.unshift('한라봉') 배열 첫번째에 넣기.

join 은 array의 메서드
split 는 string 의 메서드

'010.1000.1000'
num.split('.').join('-')
// split 으로 배열로 만들어주고 join 으로 - 를 추가해준다.



과일
(6) ['과일상자', '사과', '수박', '복숭아', '딸기', '바나나']
과일.splice(2, 3) // 앞 index , 뒤 갯수.
(3) ['수박', '복숭아', '딸기']


let 과일 = ['사과', '수박', '복숭아', '딸기', '바나나'];

let 제주과일 = ['귤','한라봉','천혜향'];

//두개의 배열을 합친다. 합쳐진 배열이 뒤로 배열된다.
과일.concat(제주과일);
(8) ['사과', '수박', '복숭아', '딸기', '바나나', '귤', '한라봉', '천혜향']
제주과일.concat(과일);
(8) ['귤', '한라봉', '천혜향', '사과', '수박', '복숭아', '딸기', '바나나']


// 정렬
let data = [10,20,30,11,22,25];


//사전식 정렬이다.
data.sort()
(6) [10, 11, 20, 22, 25, 30] //결과값 

array.sort((a,b) =>a-b);  오름
array.sort((a,b) => b-a);  내림 

//역정렬이 아닌 역순이다.
data.reverse()
(6) [25, 22, 11, 30, 20, 10]
data.reverse()
(6) [10, 20, 30, 11, 22, 25]